<template>
    <el-table
            :data="tableData"
            style="width: 100%">
        <el-table-column
                prop="date"
                label="日期"
                width="110">
        </el-table-column>
        <el-table-column
                prop="author"
                label="作者"
                width="90">
        </el-table-column>
        <el-table-column
                prop="text"
                label="文本">
        </el-table-column>
    </el-table>
</template>

<script>
    import Footer from "../components/Footer";
    export default {
        name: 'article',
        components: {Footer},
        data() {
            return {
                activeIndex: '1',
                defaultText:'这一切都要从1930年9月的一天说起。这一天，在北京的小院里，一个名叫袁隆平的男婴出生了。',
                tableData: [{
                    date: '1930-09-07',
                    author: '香港记者',
                    text: '这一切都要从1930年9月的一天说起。这一天，在北京的小院里，一个名叫袁隆平的男婴出生了。'
                }, {
                    date: '2016-05-04',
                    author: '王小虎',
                    text: '上海市普陀区金沙江路 1517 弄'
                }, {
                    date: '2016-05-01',
                    author: '王小虎',
                    text: '上海市普陀区金沙江路 1519 弄'
                }, {
                    date: '2016-05-01',
                    author: '王小虎',
                    text: '上海市普陀区金沙江路 1519 弄'
                }, {
                    date: '2016-05-01',
                    author: '王小虎',
                    text: '上海市普陀区金沙江路 1519 弄'
                }, {
                    date: '2016-05-01',
                    author: '王小虎',
                    text: '庆历四年春，滕子京谪守巴陵郡。越明年，政通人和，百废具兴，乃重修岳阳楼，增其旧制，刻唐贤今人诗赋于其上；属予作文以记之。\n' +
                        '\n' +
                        '予观夫巴陵胜状，在洞庭一湖。衔远山，吞长江，浩浩汤汤，横无际涯；朝晖夕阴，气象万千；此则岳阳楼之大观也，前人之述备矣。然则北通巫峡，南极潇湘，迁客骚人，多会于此，览物之情，得无异乎？\n' +
                        '\n' +
                        '若夫霪雨霏霏，连月不开；阴风怒号，浊浪排空；日星隐曜，山岳潜形；商旅不行，樯倾楫摧；薄暮冥冥，虎啸猿啼；登斯楼也，则有去国怀乡，忧谗畏讥，满目萧然，感极而悲者矣！\n' +
                        '\n' +
                        '至若春和景明，波澜不惊，上下天光，一碧万顷；沙鸥翔集，锦鳞游泳，岸芷汀兰，郁郁青青。而或长烟一空，皓月千里，浮光跃金，静影沉璧；渔歌互答，此乐何极。登斯楼也，则有心旷神怡，宠辱皆忘，把酒临风，其喜洋洋者矣。\n' +
                        '\n' +
                        '嗟夫！予尝求古仁人之心，或异二者之为，何哉？不以物喜，不以己悲。居庙堂之高，则忧其民；处江湖之远，则忧其君。是进亦忧，退亦忧；然则何时而乐耶？其必曰：“先天下之忧而忧，后天下之乐而乐”欤！噫！微斯人，吾谁与归？\n' +
                        '\n' +
                        '时六年九月十五日。'
                }, {
                    date: '2016-05-03',
                    author: '王小虎',
                    text: '庆历四年春，滕子京谪守巴陵郡。越明年，政通人和，百废具兴，乃重修岳阳楼，增其旧制，刻唐贤今人诗赋于其上；属予作文以记之。\n' +
                        '\n' +
                        '予观夫巴陵胜状，在洞庭一湖。衔远山，吞长江，浩浩汤汤，横无际涯；朝晖夕阴，气象万千；此则岳阳楼之大观也，前人之述备矣。然则北通巫峡，南极潇湘，迁客骚人，多会于此，览物之情，得无异乎？\n' +
                        '\n' +
                        '若夫霪雨霏霏，连月不开；阴风怒号，浊浪排空；日星隐曜，山岳潜形；商旅不行，樯倾楫摧；薄暮冥冥，虎啸猿啼；登斯楼也，则有去国怀乡，忧谗畏讥，满目萧然，感极而悲者矣！\n' +
                        '\n' +
                        '至若春和景明，波澜不惊，上下天光，一碧万顷；沙鸥翔集，锦鳞游泳，岸芷汀兰，郁郁青青。而或长烟一空，皓月千里，浮光跃金，静影沉璧；渔歌互答，此乐何极。登斯楼也，则有心旷神怡，宠辱皆忘，把酒临风，其喜洋洋者矣。\n' +
                        '\n' +
                        '嗟夫！予尝求古仁人之心，或异二者之为，何哉？不以物喜，不以己悲。居庙堂之高，则忧其民；处江湖之远，则忧其君。是进亦忧，退亦忧；然则何时而乐耶？其必曰：“先天下之忧而忧，后天下之乐而乐”欤！噫！微斯人，吾谁与归？\n' +
                        '\n' +
                        '时六年九月十五日。'
                }]
            };
        },
        methods: {
            handleSelect(key, keyPath) {
                console.log(key, keyPath);
            }
        }
    }
</script>

<style>
    .el-header, .el-footer {
        background-color: #B3C0D1;
        color: #333;
        text-align: center;
        line-height: 60px;
    }


    .el-main {
        background-color: #E9EEF3;
        color: #333;
        text-align: center;
    }

    body > .el-container {
        margin-bottom: 40px;
    }
</style>
